andrewrt/rt1052-sleep-test/board/pin_mux.c
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
     IOMUXC_SetPinConfig(
         IOMUXC_GPIO_EMC_22_SEMC_BA1,            /* GPIO_EMC_22 PAD functional properties : */
         0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/7
                                                    Speed Field: max(200MHz)
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
     IOMUXC_SetPinConfig(
         IOMUXC_GPIO_EMC_23_SEMC_ADDR10,         /* GPIO_EMC_23 PAD functional properties : */
         0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/7
                                                    Speed Field: max(200MHz)
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
     IOMUXC_SetPinConfig(
         IOMUXC_GPIO_EMC_24_SEMC_CAS,            /* GPIO_EMC_24 PAD functional properties : */
         0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/7
                                                    Speed Field: max(200MHz)
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
     IOMUXC_SetPinConfig(
         IOMUXC_GPIO_EMC_25_SEMC_RAS,            /* GPIO_EMC_25 PAD functional properties : */
         0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/7
                                                    Speed Field: max(200MHz)
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
     IOMUXC_SetPinConfig(
         IOMUXC_GPIO_EMC_26_SEMC_CLK,            /* GPIO_EMC_26 PAD functional properties : */
         0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/7
                                                    Speed Field: max(200MHz)
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
     IOMUXC_SetPinConfig(
         IOMUXC_GPIO_EMC_27_SEMC_CKE,            /* GPIO_EMC_27 PAD functional properties : */
         0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/7
                                                    Speed Field: max(200MHz)
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
     IOMUXC_SetPinConfig(
         IOMUXC_GPIO_EMC_28_SEMC_WE,             /* GPIO_EMC_28 PAD functional properties : */
         0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/7
                                                    Speed Field: max(200MHz)
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
     IOMUXC_SetPinConfig(
         IOMUXC_GPIO_EMC_29_SEMC_CS0,            /* GPIO_EMC_29 PAD functional properties : */
         0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/7
                                                    Speed Field: max(200MHz)
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
     IOMUXC_SetPinConfig(
         IOMUXC_GPIO_EMC_30_SEMC_DATA08,         /* GPIO_EMC_30 PAD functional properties : */
         0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/7
                                                    Speed Field: max(200MHz)
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
     IOMUXC_SetPinConfig(
         IOMUXC_GPIO_EMC_31_SEMC_DATA09,         /* GPIO_EMC_31 PAD functional properties : */
         0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/7
                                                    Speed Field: max(200MHz)
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
     IOMUXC_SetPinConfig(
         IOMUXC_GPIO_EMC_32_SEMC_DATA10,         /* GPIO_EMC_32 PAD functional properties : */
         0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/7
                                                    Speed Field: max(200MHz)
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
     IOMUXC_SetPinConfig(
         IOMUXC_GPIO_EMC_33_SEMC_DATA11,         /* GPIO_EMC_33 PAD functional properties : */
         0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/7
                                                    Speed Field: max(200MHz)
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
     IOMUXC_SetPinConfig(
         IOMUXC_GPIO_EMC_34_SEMC_DATA12,         /* GPIO_EMC_34 PAD functional properties : */
         0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/7
                                                    Speed Field: max(200MHz)
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
     IOMUXC_SetPinConfig(
         IOMUXC_GPIO_EMC_35_SEMC_DATA13,         /* GPIO_EMC_35 PAD functional properties : */
         0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/7
                                                    Speed Field: max(200MHz)
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
     IOMUXC_SetPinConfig(
         IOMUXC_GPIO_EMC_36_SEMC_DATA14,         /* GPIO_EMC_36 PAD functional properties : */
         0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/7
                                                    Speed Field: max(200MHz)
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
     IOMUXC_SetPinConfig(
         IOMUXC_GPIO_EMC_37_SEMC_DATA15,         /* GPIO_EMC_37 PAD functional properties : */
         0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/7
                                                    Speed Field: max(200MHz)
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
     IOMUXC_SetPinConfig(
         IOMUXC_GPIO_EMC_38_SEMC_DM01,           /* GPIO_EMC_38 PAD functional properties : */
         0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/7
                                                    Speed Field: max(200MHz)
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
     IOMUXC_SetPinConfig(
         IOMUXC_GPIO_EMC_39_SEMC_DQS,            /* GPIO_EMC_39 PAD functional properties : */
         0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/7
                                                    Speed Field: max(200MHz)
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
     IOMUXC_SetPinConfig(
         IOMUXC_GPIO_EMC_40_SEMC_RDY,            /* GPIO_EMC_40 PAD functional properties : */
         0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/7
                                                    Speed Field: max(200MHz)
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
     IOMUXC_SetPinConfig(
         IOMUXC_GPIO_EMC_41_SEMC_CSX00,          /* GPIO_EMC_41 PAD functional properties : */
         0x0110F9u);                             /* Slew Rate Field: Fast Slew Rate
                                                    Drive Strength Field: R0/7
                                                    Speed Field: max(200MHz)
                                                    Open Drain Enable Field: Open Drain Disabled
                                                    Pull / Keep Enable Field: Pull/Keeper Enabled
                                                    Pull / Keep Select Field: Keeper
                                                    Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                    Hyst. Enable Field: Hysteresis Enabled */
}


