andrewrt/rt1052-sleep-test/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCSIPins:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: H13, peripheral: CSI, signal: 'csi_data, 09', pin_signal: GPIO_AD_B1_08}
  - {pin_num: M13, peripheral: CSI, signal: 'csi_data, 08', pin_signal: GPIO_AD_B1_09}
  - {pin_num: L13, peripheral: CSI, signal: 'csi_data, 07', pin_signal: GPIO_AD_B1_10}
  - {pin_num: J13, peripheral: CSI, signal: 'csi_data, 06', pin_signal: GPIO_AD_B1_11}
  - {pin_num: H12, peripheral: CSI, signal: 'csi_data, 05', pin_signal: GPIO_AD_B1_12}
  - {pin_num: H11, peripheral: CSI, signal: 'csi_data, 04', pin_signal: GPIO_AD_B1_13}
  - {pin_num: J14, peripheral: CSI, signal: 'csi_data, 02', pin_signal: GPIO_AD_B1_15}
  - {pin_num: G12, peripheral: CSI, signal: 'csi_data, 03', pin_signal: GPIO_AD_B1_14}
  - {pin_num: L12, peripheral: CSI, signal: csi_pixclk, pin_signal: GPIO_AD_B1_04}
  - {pin_num: K12, peripheral: CSI, signal: csi_mclk, pin_signal: GPIO_AD_B1_05}
  - {pin_num: J12, peripheral: CSI, signal: csi_vsync, pin_signal: GPIO_AD_B1_06}
  - {pin_num: K10, peripheral: CSI, signal: csi_hsync, pin_signal: GPIO_AD_B1_07}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCSIPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCSIPins(void) {

//  IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B0_04_GPIO1_IO04, 0U);

  IOMUXC_SetPinMux( IOMUXC_GPIO_B1_12_CSI_PIXCLK, 0U);
  IOMUXC_SetPinMux( IOMUXC_GPIO_B1_15_CSI_MCLK, 0U);
  IOMUXC_SetPinMux( IOMUXC_GPIO_B1_13_CSI_VSYNC, 0U);
  IOMUXC_SetPinMux( IOMUXC_GPIO_B1_14_CSI_HSYNC, 0U);

  IOMUXC_SetPinMux( IOMUXC_GPIO_B1_04_CSI_DATA15, 0U);
  IOMUXC_SetPinMux( IOMUXC_GPIO_B1_05_CSI_DATA14, 0U);
  IOMUXC_SetPinMux( IOMUXC_GPIO_B1_06_CSI_DATA13, 0U);
  IOMUXC_SetPinMux( IOMUXC_GPIO_B1_07_CSI_DATA12, 0U);
  IOMUXC_SetPinMux( IOMUXC_GPIO_B1_08_CSI_DATA11, 0U);
  IOMUXC_SetPinMux( IOMUXC_GPIO_B1_09_CSI_DATA10, 0U);

  IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_08_CSI_DATA09, 0U);
  IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_09_CSI_DATA08, 0U);
  IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_10_CSI_DATA07, 0U);
  IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_11_CSI_DATA06, 0U);
  IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_12_CSI_DATA05, 0U);
  IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_13_CSI_DATA04, 0U);
  IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_14_CSI_DATA03, 0U);
  IOMUXC_SetPinMux( IOMUXC_GPIO_AD_B1_15_CSI_DATA02, 0U);

  IOMUXC_SetPinMux( IOMUXC_GPIO_B1_11_CSI_DATA01, 0U);
  IOMUXC_SetPinMux( IOMUXC_GPIO_B1_10_CSI_DATA00, 0U);


}



/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLPI2C1Pins:
- options: {coreID: core0, enableClock: 'true'}
- pin_list:

  - {pin_num: J11, peripheral: LPI2C1, signal: SCL, pin_signal: GPIO_AD_B1_00, slew_rate: Slow, software_input_on: Enable, open_drain: Enable, speed: MHZ_100, drive_strength: R0_6,
    pull_keeper_select: Keeper, pull_keeper_enable: Enable, pull_up_down_config: Pull_Up_22K_Ohm, hysteresis_enable: Disable}
  - {pin_num: K11, peripheral: LPI2C1, signal: SDA, pin_signal: GPIO_AD_B1_01, slew_rate: Slow, software_input_on: Enable, open_drain: Enable, speed: MHZ_100, drive_strength: R0_6,
    pull_keeper_select: Keeper, pull_keeper_enable: Enable, pull_up_down_config: Pull_Up_22K_Ohm, hysteresis_enable: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitLPI2C1Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitLPI2C1Pins(void) {
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_00_LPI2C1_SCL,        /* GPIO_AD_B1_00 is configured as LPI2C1_SCL */
      1U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B1_01_LPI2C1_SDA,        /* GPIO_AD_B1_01 is configured as LPI2C1_SDA */
      1U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B1_00_LPI2C1_SCL,        /* GPIO_AD_B1_00 PAD functional properties : */
      0xD8B0u);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Enabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 22K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B1_01_LPI2C1_SDA,        /* GPIO_AD_B1_01 PAD functional properties : */
      0xD8B0u);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Enabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 22K Ohm Pull Up
                                                 Hyst. Enable Field: Hysteresis Disabled */
}




